{
    "Body":"I have an Asus Transformer Eee Pad. I recently purchased a stylus that allows for pen-precise writing and wanted to utilize my tablet as a note taking device. I have found several apps for this purpose, but none of them allow for recognition of my hand, which confuses the screen. If I rest my hand on the edges of the tablet I am fine, but that only works if I am writing on the outer edges of the \"sheet\", and I would ideally like to utilize the whole page for notes. Does anyone know if there is an app for Android tablets out there that is capable of this functionality? My friend's iPad had an app that allowed him to designate a \"dead\" area of his screen so he could rest his hand on it and the iPad ignored input from that area, allowing him to take notes with ease and I admit I was pretty jealous. I'm hoping there is some similar app out there for Android. Thank you in advance for any help you may be able to provide. ",
    "ViewCount":"1254",
    "LastActivityDate":"2012-06-19T21:40:40.953",
    "ClosedDate":"2013-03-24T19:42:29.293",
    "Title":"Note taking app with a hand guard\/hand recognition feature?",
    "LastEditorUserId":"6052",
    "Tags":"",
    "LastEditDate":"2012-06-19T21:38:42.907",
    "CommentCount":"2",
    "AnswerCount":"1",
    "AcceptedAnswerId":null,
    "Score":"2",
    "CommunityOwnedDate":null,
    "LastEditorDisplayName":null,
    "PostTypeId":"1",
    "OwnerUserId":"11040",
    "CreationDate":"2011-12-27T23:44:35.463",
    "FavoriteCount":"1",
    "Id":"17494",
    "history":[
        {
            "Comment":null,
            "CreationDate":"2011-12-27T23:44:35.463",
            "UserDisplayName":null,
            "RevisionGUID":"6e8eb6ff-af0d-4319-89ca-efff44f55550",
            "UserId":"11040",
            "CloseReasonId":null,
            "PostId":"17494",
            "PostHistoryTypeId":"2",
            "Id":"47851",
            "Text":"I have an Asus Transformer eee Pad, and I like the device a lot. I recently purchased a stylus that allows for pen-precise writing and wanted to utilize my tablet as a note taking device. I have found several apps for this purpose, but none of them allow for recognition of my hand, which confuses the screen. If I rest my hand on the edges of the tablet I am fine, but that only works if I am writing on the outer edges of the \"sheet\", and I would ideally like to utilize the whole page for notes. Does anyone know if there is an app for android tablets out there (paid or otherwise) that is capable of this functionality? My friend's iPad had an app that allowed him to designate a \"dead\" area of his screen so he could rest his hand on it and the iPad ignored input from that area, allowing him to take notes with ease and I admit I was pretty jealous. I'm hoping there is some similar app out there for Android. Thank you in advance for any help you may be able to provide. "
        },
        {
            "Comment":null,
            "CreationDate":"2011-12-27T23:44:35.463",
            "UserDisplayName":null,
            "RevisionGUID":"6e8eb6ff-af0d-4319-89ca-efff44f55550",
            "UserId":"11040",
            "CloseReasonId":null,
            "PostId":"17494",
            "PostHistoryTypeId":"1",
            "Id":"47852",
            "Text":"Note taking app with a hand guard\/hand recognition feature?"
        },
        {
            "Comment":null,
            "CreationDate":"2011-12-27T23:44:35.463",
            "UserDisplayName":null,
            "RevisionGUID":"6e8eb6ff-af0d-4319-89ca-efff44f55550",
            "UserId":"11040",
            "CloseReasonId":null,
            "PostId":"17494",
            "PostHistoryTypeId":"3",
            "Id":"47853",
            "Text":""
        },
        {
            "Comment":"deleted 33 characters in body",
            "CreationDate":"2012-06-19T21:38:42.907",
            "UserDisplayName":null,
            "RevisionGUID":"80474bd4-7d90-43a1-b349-b185f7d5965c",
            "UserId":"6052",
            "CloseReasonId":null,
            "PostId":"17494",
            "PostHistoryTypeId":"5",
            "Id":"70047",
            "Text":"I have an Asus Transformer Eee Pad. I recently purchased a stylus that allows for pen-precise writing and wanted to utilize my tablet as a note taking device. I have found several apps for this purpose, but none of them allow for recognition of my hand, which confuses the screen. If I rest my hand on the edges of the tablet I am fine, but that only works if I am writing on the outer edges of the \"sheet\", and I would ideally like to utilize the whole page for notes. **Does anyone know if there is an app for Android tablets out there that is capable of this functionality?** My friend's iPad had an app that allowed him to designate a \"dead\" area of his screen so he could rest his hand on it and the iPad ignored input from that area, allowing him to take notes with ease and I admit I was pretty jealous. I'm hoping there is some similar app out there for Android. Thank you in advance for any help you may be able to provide. "
        },
        {
            "Comment":"2",
            "CreationDate":"2013-03-24T19:42:29.293",
            "UserDisplayName":null,
            "RevisionGUID":"cd46514e-8fd6-4b01-9b7b-bc5393aeb67a",
            "UserId":"10",
            "CloseReasonId":null,
            "PostId":"17494",
            "PostHistoryTypeId":"10",
            "Id":"133015",
            "Text":"{\"Voters\":[{\"Id\":16575,\"DisplayName\":\"Izzy\"},{\"Id\":4003,\"DisplayName\":\"t0mm13b\"},{\"Id\":8197,\"DisplayName\":\"roxan\"},{\"Id\":10,\"DisplayName\":\"Bryan Denny\"}]}"
        }
    ]
}