{
    "Body":"  Possible Duplicate:  My device is getting slow, apps start misbehaving\/crashing. What can I do?  I have a Samsung Galaxy S which I've had for less than a year now. It has been working fine until the last couple of weeks, when I've noticed the performance slowing down. I don't use many apps, but lately I've downloaded a few games and whatnot. One particular recent issue is that whenever I access the keypad to call someone, it closes down automatically without letting me finish typing out the number. Other problems include: mobile internet crashes systematically every other night (when I use it the most); the FB app force closes automatically and since FB is an integral part of Zynga games, my Words with Friends is almost inaccessible because of FB crashing. Anyone else with similar problems? I know HTC issues an automatic software update, but why haven't I heard of anything for Samsung? Any help would be appreciated.",
    "ViewCount":"1001",
    "LastActivityDate":"2012-04-13T05:03:38.790",
    "ClosedDate":"2012-12-19T15:48:23.587",
    "Title":"Why does my Samsung Galaxy S keep crashing\/slow performance?",
    "LastEditorUserId":null,
    "Tags":"",
    "LastEditDate":null,
    "CommentCount":"4",
    "AnswerCount":"0",
    "AcceptedAnswerId":null,
    "Score":"2",
    "CommunityOwnedDate":null,
    "LastEditorDisplayName":null,
    "PostTypeId":"1",
    "OwnerUserId":"14229",
    "CreationDate":"2012-04-13T05:03:38.790",
    "FavoriteCount":null,
    "Id":"21773",
    "history":[
        {
            "Comment":null,
            "CreationDate":"2012-04-13T05:03:38.790",
            "UserDisplayName":null,
            "RevisionGUID":"35af8ae1-2cef-4bf9-b509-4b2d29a8d872",
            "UserId":"14229",
            "CloseReasonId":null,
            "PostId":"21773",
            "PostHistoryTypeId":"2",
            "Id":"61011",
            "Text":"I have a Samsung Galaxy S which I've had for less than a year now. It has been working fine until the last couple of weeks, when I've noticed the performance slowing down. I don't use many apps, but lately I've downloaded a few games and whatnot. One particular recent issue is that whenever I access the keypad to call someone, it closes down automatically without letting me finish typing out the number. Other problems include: mobile internet crashes systematically every other night (when I use it the most); the FB app force closes automatically and since FB is an integral part of Zynga games, my Words with Friends is almost inaccessible because of FB crashing. Anyone else with similar problems? I know HTC issues an automatic software update, but why haven't I heard of anything for Samsung? Any help would be appreciated."
        },
        {
            "Comment":null,
            "CreationDate":"2012-04-13T05:03:38.790",
            "UserDisplayName":null,
            "RevisionGUID":"35af8ae1-2cef-4bf9-b509-4b2d29a8d872",
            "UserId":"14229",
            "CloseReasonId":null,
            "PostId":"21773",
            "PostHistoryTypeId":"1",
            "Id":"61012",
            "Text":"Why does my Samsung Galaxy S keep crashing\/slow performance?"
        },
        {
            "Comment":null,
            "CreationDate":"2012-04-13T05:03:38.790",
            "UserDisplayName":null,
            "RevisionGUID":"35af8ae1-2cef-4bf9-b509-4b2d29a8d872",
            "UserId":"14229",
            "CloseReasonId":null,
            "PostId":"21773",
            "PostHistoryTypeId":"3",
            "Id":"61013",
            "Text":""
        },
        {
            "Comment":"insert duplicate link",
            "CreationDate":"2012-12-19T15:48:23.587",
            "UserDisplayName":null,
            "RevisionGUID":"785207b3-b343-4b65-ad64-e7fd0e460e6e",
            "UserId":"-1",
            "CloseReasonId":null,
            "PostId":"21773",
            "PostHistoryTypeId":"5",
            "Id":"107463",
            "Text":"> **Possible Duplicate:**  > [My device is getting slow, apps start misbehaving\/crashing. What can I do?](http:\/\/android.stackexchange.com\/questions\/35367\/my-device-is-getting-slow-apps-start-misbehaving-crashing-what-can-i-do)  I have a Samsung Galaxy S which I've had for less than a year now. It has been working fine until the last couple of weeks, when I've noticed the performance slowing down. I don't use many apps, but lately I've downloaded a few games and whatnot. One particular recent issue is that whenever I access the keypad to call someone, it closes down automatically without letting me finish typing out the number. Other problems include: mobile internet crashes systematically every other night (when I use it the most); the FB app force closes automatically and since FB is an integral part of Zynga games, my Words with Friends is almost inaccessible because of FB crashing. Anyone else with similar problems? I know HTC issues an automatic software update, but why haven't I heard of anything for Samsung? Any help would be appreciated."
        },
        {
            "Comment":"1",
            "CreationDate":"2012-12-19T15:48:23.587",
            "UserDisplayName":null,
            "RevisionGUID":"41cce558-1d40-4ef1-ac53-9ad82a796159",
            "UserId":"475",
            "CloseReasonId":null,
            "PostId":"21773",
            "PostHistoryTypeId":"10",
            "Id":"107464",
            "Text":"{\"OriginalQuestionIds\":[35367],\"Voters\":[{\"Id\":475,\"DisplayName\":\"onik\"}]}"
        }
    ]
}